<template>
  <div class="max-w-[1100px] mx-auto px-4 py-16 space-y-8 text-black dark:text-white">
    <p>2026.2.19 优化导航栏在浅色模式下的显示效果</p>
    <p>2026.2.19 新的背景</p>
    <p>2026.2.16 移植按钮交互效果</p>
    <p>2026.2.16 移植深浅模式按钮图标切换动画</p>
    <p>2026.2.16 移植深浅模式切换功能</p>
    <p>2026.2.15 重置导航栏</p>
    <p>2026.2.14 船新的网站风格!</p>
    <p>2026.2.13 全站迁移至Nuxt</p>
    <p>2026.2.10 引入markdown解析</p>
    <p>2026.2.10 后端接口对接完成</p>
    <p>2026.2.3 修复由于父元素使用模糊导致子元素模糊失效的问题</p>
    <p>2026.2.1 '关于' 使用下拉菜单展示</p>
    <p>2026.1.30 新增许可声明</p>
    <p>2026.1.29 新增字体抗锯齿</p>
    <p>2026.1.29 使用 HarmonyOS Sans 字体</p>
    <p>2026.1.28 优化按钮交互效果</p>
    <p>2026.1.28 修复按钮点击跳转范围与按钮实际大小不匹配的问题</p>
    <p>2026.1.25 新增背景光斑与鼠标交互效果</p>
    <p>2026.1.25 背景适配深浅模式过渡效果</p>
    <p>2026.1.25 优化动态背景性能</p>
    <p>2026.1.24 废除原静态背景, 改用动态效果</p>
    <p>2026.1.23 后端接口编写完成</p>
    <p>2026.1.23 与数据库对接成功</p>
    <p>2025.10.4 新增 '侧边栏'</p>
    <p>2025.10.3 新增 '深色模式' 图标切换动画</p>
    <p>2025.10.3 新增 'BiliBili' 'GitHub' 图标</p>
    <p>2025.10.2 新增 '深色模式' 鼠标悬停动画</p>
    <p>2025.10.1 新增 '深色模式'</p>
  </div>
</template>