<template>
  <div class="Log">
    <p>2026.1.29 新增字体抗锯齿</p>
    <p>2026.1.29 使用 HarmonyOS Sans 字体</p>
    <p>2026.1.28 优化按钮交互效果</p>
    <p>2026.1.28 修复按钮点击跳转范围与按钮实际大小不匹配的问题</p>
    <p>2026.1.25 新增背景光斑与鼠标交互效果</p>
    <p>2026.1.25 背景适配深浅模式过渡效果</p>
    <p>2026.1.25 优化动态背景性能</p>
    <p>2026.1.24 废除原静态背景, 改用动态效果</p>
    <p>2026.1.23 后端接口编写完成</p>
    <p>2026.1.23 与数据库对接成功</p>
    <p>2025.10.4 新增 '侧边栏'</p>
    <p>2025.10.3 新增 '深色模式' 图标切换动画</p>
    <p>2025.10.3 新增 'BiliBili' 'GitHub' 图标</p>
    <p>2025.10.2 新增 '深色模式' 鼠标悬停动画</p>
    <p>2025.10.1 新增 '深色模式'</p>
  </div>
</template>

<script setup lang="ts">

</script>

<style scoped>

</style>